package main

import (
	"fmt"

	"github.com/alecthomas/kong"
)

//   ▄████  ▒█████   ██ ▄█▀
//  ██▒ ▀█▒▒██▒  ██▒ ██▄█▒
// ▒██░▄▄▄░▒██░  ██▒▓███▄░
// ░▓█  ██▓▒██   ██░▓██ █▄
// ░▒▓███▀▒░ ████▓▒░▒██▒ █▄
//  ░▒   ▒ ░ ▒░▒░▒░ ▒ ▒▒ ▓▒
//   ░   ░   ░ ▒ ▒░ ░ ░▒ ▒░
// ░ ░   ░ ░ ░ ░ ▒  ░ ░░ ░
//       ░     ░ ░  ░  ░
// Gok: Reverse shell handler

const VERSION = "0.0"

func main() {
    fmt.Println()
    fmt.Println("\tGOK: Reverse Shell Handler")
    fmt.Println("")
    fmt.Println(
	"\t  ▄████  ▒█████   ██ ▄█▀\n",
	"\t ██▒ ▀█▒▒██▒  ██▒ ██▄█▒ \n",
	"\t▒██░▄▄▄░▒██░  ██▒▓███▄░ \n",
	"\t░▓█  ██▓▒██   ██░▓██ █▄ \n",
	"\t░▒▓███▀▒░ ████▓▒░▒██▒ █▄\n",
	"\t ░▒   ▒ ░ ▒░▒░▒░ ▒ ▒▒ ▓▒\n",
	"\t  ░   ░   ░ ▒ ▒░ ░ ░▒ ▒░\n",
	"\t░ ░   ░ ░ ░ ░ ▒  ░ ░░ ░ \n",
	"\t      ░     ░ ░  ░  ░   \n",
	"")
    fmt.Printf("\tVersion: %s (Alpha)", VERSION)
    fmt.Println()

    kong.Parse(&Flags)

    config := Config{
	PortRange: Flags.PortRange,
	bindIps:   Flags.BoundIPs,
    }

    core := NewCore(config)
    core.InitListeners()

    core.RunREPL()
}
